# Permutation and Random Sampling

In [1]:
import pandas as pd
import numpy as np
df = pd.DataFrame(np.arange(5 * 4).reshape((5, 4)))

#random values are assinged between range 0-4 
#places randomly
sampler = np.random.permutation(5)
sampler

array([1, 4, 3, 2, 0])

In [2]:
df.take(sampler) #

    0   1   2   3
1   4   5   6   7
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
0   0   1   2   3

In [3]:
df.sample(n=3) #index ko randomly arrange karega

#how to create doc screen see

    0   1   2   3
3  12  13  14  15
4  16  17  18  19
1   4   5   6   7

In [4]:
#
df = pd.DataFrame({'key': ['b', 'b', 'a', 'c', 'a', 'b'], 'data1': range(6)})
pd.get_dummies(df['key'])

   a  b  c
0  0  1  0
1  0  1  0
2  1  0  0
3  0  0  1
4  1  0  0
5  0  1  0

In [5]:
a = [1,2,3]
a.append([4,5,6])
a

[1, 2, 3, [4, 5, 6]]

In [6]:
a.extend([4,5,6]) #extend iterate karega.
a

[1, 2, 3, [4, 5, 6], 4, 5, 6]

In [7]:
a = 'a,b,gu'
" ".join(a)

'a , b , g u'

# Chapter 8
## Multi indexing

In [8]:
data = pd.Series(np.random.randn(9), index=[['a', 'a', 'a', 'b', 'b', 'c', 'c', 'd', 'd'], [1, 2, 3, 1, 3, 1, 2, 2, 3]])
data

a  1    1.603570
   2    1.393386
   3   -0.722813
b  1   -1.268204
   3   -0.452667
c  1   -1.174852
   2    0.324654
d  2   -0.483448
   3    0.794083
dtype: float64

In [9]:
data.loc[:, [2,1]] # we need 1, 2 of each a,b,c etc

a  1    1.603570
   2    1.393386
b  1   -1.268204
c  1   -1.174852
   2    0.324654
d  2   -0.483448
dtype: float64

In [10]:
data.loc['a':'b', [2,1]]

a  1    1.603570
   2    1.393386
b  1   -1.268204
dtype: float64

In [11]:
data.unstack(fill_value=1) # mutli index ko database mein convert kardega

          1         2         3
a  1.603570  1.393386 -0.722813
b -1.268204  1.000000 -0.452667
c -1.174852  0.324654  1.000000
d  1.000000 -0.483448  0.794083

In [21]:
frame = pd.DataFrame(np.arange(12).reshape((4, 3)), 
                     index=[['a', 'a', 'a', 'b'], [1, 2, 3, 1]],
                     columns=[['Pakistan', 'Pakistan','India'], ['Karachi', 'Lahore', 'Banglore']])
frame

    Pakistan           India
     Karachi Lahore Banglore
a 1        0      1        2
  2        3      4        5
  3        6      7        8
b 1        9     10       11

In [24]:
frame['Pakistan'].loc['b',1]

Karachi     9
Lahore     10
Name: (b, 1), dtype: int32